app/controllers/school_classes_controller.rb

    def create
        school_class = SchoolClass.create(params[:school_class])
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2017-07-24 21:25:54.702898"], ["updated_at", "2017-07-24 21:25:54.702898"]]

    def update
        school_class = SchoolClass.find(params[:id])
        school_class.update(params[:school_class])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2017-07-24 21:23:50.166293"], ["id", 1]]