app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-07-24 21:25:24.133820"], ["updated_at", "2017-07-24 21:25:24.133820"]]
---
    def create
        student = Student.create(params[:student])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-07-24 21:21:01.878315"], ["id", 1]]
---
    def update
        student = Student.find(params[:id])
        student.update(params[:student])